#+title: Automate (offline) backups with restic and systemd
#+DESCRIPTION: Use pass, systemd path units and GPG pinentry to automate your backups without revealing your passwords
#+hugo_section: images-in-content
#+tags[]: systemd restic
#+twitter_card: summary
#+twitter_image: https://blog.hoetzel.info/img/restic.png
#+DATE: 2020-02-17
#+SLUG: automate restic backups

This blog post builds on the content of the fedora magazine article [[https://fedoramagazine.org/automate-backups-with-restic-and-systemd/][Automate backups with restic and systemd]].


2 important features were missing in the article for my use case:

- Don't reveal restic passwords in plain-text files
- Backup to offline storage (USB flash drive)

Fortunately modern Linux distributions offer all mechanisms to
implement these 2 requirements:

- [[http://storaged.org/][Udisks(2)]] allows non-privileged users to mount external USB-disks automatically
- [[https://www.freedesktop.org/software/systemd/man/systemd.path.html][systemd.path]] allows path-based activation of systemd units
- [[https://restic.net/][restic]] can be configured call an external command to retrieve the password
- [[https://www.passwordstore.org/][pass]] the UNIX password manager uses [[https://gnupg.org/][GPG]], which in turn uses [[https://gnupg.org/related_software/pinentry/][pinentry]]
  to retrieve the =pass= master-password

The remaining task is to combine the mechanisms so that the backup
starts automatically when the USB flash drive is inserted. Furthermore a
status message should be displayed after the backup.


* Udisks automount

Storage devices that are plugged into the system mount automatically
as long as [[https://www.freedesktop.org/software/polkit/docs/latest/polkit.8.html][polkit]] does not get in the way. The default =udisks2=
policy should allow users on local consoles to mount the file systems:
#+BEGIN_SRC bash :results value verbatim
pkaction  -a org.freedesktop.udisks2.filesystem-mount -v
#+END_SRC

#+RESULTS:
#+begin_example
org.freedesktop.udisks2.filesystem-mount:
  description:       Mount a filesystem
  message:           Authentication is required to mount the filesystem
  vendor:            The Udisks Project
  vendor_url:        https://github.com/storaged-project/udisks
  icon:              drive-removable-media
  implicit any:      auth_admin
  implicit inactive: auth_admin
  implicit active:   yes

#+end_example

=implicit active= applies to clients in active sessions on local
 consoles. The value =yes= means that mounting file systems doesn't require extra
 authentication.

You can use =pkcheck= to check if you have access from your session:
#+BEGIN_SRC bash
pkcheck -u -p $$ -a org.freedesktop.udisks2.filesystem-mount && echo can mount!
#+END_SRC

#+RESULTS:
: can mount!

